Revit 2027 API
ConnectionInputPoint(XYZ, Guid) Constructor
 Construct an input point from 3d point and id.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionInputPoint(
	XYZ pt,
	Guid uid
)
Public Sub New (
	pt As XYZ,
	uid As Guid
)
public:
ConnectionInputPoint(
	XYZ^ pt,
	Guid uid
)
new :
        pt : XYZ *
        uid : Guid -> ConnectionInputPoint
Parameters
pt XYZ
uid Guid
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConnectionInputPoint Class
ConnectionInputPoint Overload
Autodesk.Revit.DB.Structure Namespace